Revit 2027 API
CircuitNamingSchemeSettings.IsValidCircuitNamingSchemeId Method
 Verifies that the circuit naming scheme id can be used with CircuitNamingSchemeSettings.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidCircuitNamingSchemeId(
	Document aDocument,
	ElementId circuitNamingSchemeId
)
Public Shared Function IsValidCircuitNamingSchemeId (
	aDocument As Document,
	circuitNamingSchemeId As ElementId
) As Boolean
public:
static bool IsValidCircuitNamingSchemeId(
	Document^ aDocument,
	ElementId^ circuitNamingSchemeId
)
static member IsValidCircuitNamingSchemeId :
        aDocument : Document *
        circuitNamingSchemeId : ElementId -> bool
Parameters
aDocument Document
 The document.
circuitNamingSchemeId ElementId
 The circuit naming scheme id to be checked.
Return Value
Boolean
 True if the circuit naming scheme id is valid for CircuitNamingSchemeSettings.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CircuitNamingSchemeSettings Class
Autodesk.Revit.DB.Electrical Namespace